$zipcodes = "03824531449411615213441829505344272752010217443235";

# (?:\d\d\d\d\d)*?(44\d\d\d)
# (?:(?!44)\d\d\d\d\d)*(44\d\d\d)
# (?:[1235-9]\d\d\d\d|\d[1235-9]\d\d\d)*(44\d\d\d)

# (?:(?!44)\d\d\d\d\d)*(44\d\d\d)?
# (?:[1235-9]\d\d\d\d|\d[1235-9]\d\d\d)*(44\d\d\d)?

# 正确的解决方案1
=pod
while ($zipcodes =~ m/(?:[1235-9]\d\d\d\d|\d[1235-9]\d\d\d)*(44\d\d\d)?/g) {
  print "---zipcode---> $1\n";
}
=cut

# 正确的解决方案2
while ($zipcodes =~ m/\G(?:[1235-9]\d\d\d\d|\d[1235-9]\d\d\d)*(44\d\d\d)/g) {
  print "---zipcode---> $1\n";
}